
--------------------------------
if matches[1] == "مدیریت" then
local hash = "gp_lang:"..msg.to.id
local lang = redis:get(hash)
helpfun = [[
🔰راهنمای دستورات مدیریت ربات ضد لینک ug🔰

〰〰〰〰
📝 انتخاب مدیر گروه
👑 تنظیم مدیر
 〰〰〰〰
📝 حذف از مدیریت گروه
👑 حذف مدیر
 〰〰〰〰
📝 انتخاب معاون برای  گروه
🎖 ارتقا
 〰〰〰〰
📝 عزل از مقام مدیریتی به کاربر 
❌ عزل مدیر
 〰〰〰〰
📝 تنظیم حداکثر تعداد پیام مکرر
✏️ تنظیم حساسیت[1-50]`
 〰〰〰〰
📝 خفه کردن کاربر در گروه 
🔇 ساکت
 〰〰〰〰
📝 در آوردن کاربر از حالت خفه 
🔊 صدادار
〰〰〰〰
📝 حذف کاربر از گروه 
🚷 اخراج 
〰〰〰〰
📝 مسدود کردن کاربر از گروه 
⛔️ مسدود
〰〰〰〰
📝 در آوردن کاربر از حالت مسدودیت درگروه
⭕️ ازاد
〰〰〰〰
📝 نمایش شناسه کاربری 
💢 اطلاعات یوزرنیم 
🆔 ایدی
〰〰〰〰
📝 نمایش نام کابری و اطلاعات حساب
🆔 اطلاعات ایدی(ایدی)
〰〰〰〰
📝 تنظیم موارد زیر که ربات آنها رو ثبت خواهد کرد
💢 قوانین،عکس،لینک،درباره،خوش امد 💢
🔰 مثال:تننظیم قوانین
〰〰〰〰
📝 پاک کردن تمام لیست  های  موارد زیر  که  ربات انهار و حذف  خواهد کرد  
💢 لیست مسدودها،ربات،قوانین،درباره 💢
💢 لیست ساکت ها،فیلتر،خوش امد 💢
🔰 مثال:پاک کردن مسدودها
〰〰〰〰
📝 فیلتر کردن کلمه های زشت
📵 فیلتر
🔰 مثال:فیلتر + کلمه
〰〰〰〰
📝 پاک کردن از لیست فیلتر
🚯 حذف فیلتر
🔰 مثال:حذف فیلتر + کلمه
〰〰〰〰
📝 ربات پیام را در گروه سنجاق خواهد کرد 
📃 سنجاق 
🔰 مثال:سنجاق + ریپلای
〰〰〰〰
📝 ربات پیام سنجاق شده در گروه را حذف خواهد کرد
📃❌ حذف سنجاق
🔰 مثال:حذف سنجان + ریپلای
〰〰〰〰
📝 روشن یا خاموش کردن  خوش امد گویی در گروه
👋 خوش امد
🔰 مثال:خوش امد روشن
〰〰〰〰
📝 نمایش تنظیمات سوپر گروه
🖥 تنظیمات
〰〰〰〰
📝 نمایش فهرست موارد زیر در گروه 
💢 لیست فیلتر،لیست مسدودها،لیست ساکت ها 💢
💢 لیست مدیران،لیست معاون ها 💢
🔰 مثال:لیست مدیران
〰〰〰〰
📝 نمایش موارد زیر در گروه 
💢 قوانین،درباره،اطلاعات گروه ،لینک 💢 
🔰 مثال:اطلاعات گروه
〰〰〰〰
📝 نمایش شناسه شما و گروه
🆔 ایدی
〰〰〰〰
📝 ساخت لینک جدید توسط خود ربات 
✏️ لینک جدید
🔰 مثال:لینک جدید + لینک
〰〰〰〰
📝 ارسال لینک گروه به چت خصوصی مدیریت سودوی ربات
✏️ لینک پیوی
〰〰〰〰
📝 پاک کردن تعداد پیام اخیر سورپر گروه 
🗑 پاک کردن 
🔰 مثال:پاک کردن + عدد
💢 دقت کنید که عدداز (1 تا1000)میباشد 💢
💢 عدد ها هم به انگلیسی نوشته شود 💢
〰〰〰〰
📝 پاک کردن تمام پیام های فرد در گروه
پاک کردن 
مثال:پاک کردن + ریپلای
〰〰〰〰
📝 اضافه کردن افراد که در لیست مسدود گروه هستند به گروه
دعوت مسدود ها
〰〰〰〰

در این بخش از موارد زیر باید استفاده کنید 
مثال :میخواید فردی را مدیر کنید 
فرد + رپیلای یا یوزرنیم یا از ایدی ان استفاده کنید
 〰〰〰〰
 در زدن دستورات به فاصله حرف  دقت کنید
.....
سازنده:🌷🌺ℳʊⓢ@🌺🌷
کانال ما:@ugtaim

]]
tdcli.sendMessage(msg.chat_id_, 0, 1, helpfun, 1, 'md')
end
--------------------------------
return {               
	patterns = {
      "^(مدیریت)$",
		}, 
 run = run,
	}

--#by @ugtaim 
